Tekla Open API Reference for Tekla Structures 2025
LinkAttributes Constructor
 Creates a new link attributes instance using standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LinkAttributes()
Public Sub New
See Also
Reference
LinkAttributes Class
LinkAttributes Overload
Tekla.Structures.Drawing Namespace